Repository: Lektorium-LLC/edx-sga
Catalog: edx_sga/locale/*/LC_MESSAGES/djangojs.po
Languages: ru

source: Started preparing student submissions zip file. This may take a while.
ru: Собирается zip-архив с работами слушателей. Это может занять некоторое время.

source: Submission failed. Please contact your course instructor.
ru: Ошибка при отправке файла. Пожалуйста, свяжитесь с командой курса.

source: Uploading...
ru: Файл загружается...

source: The file you are trying to upload is too large.
ru: Файл, который вы пытаетесь загрузить, слишком велик.

source: Uploading... %(percent)s%
ru: Файл загружается... %(percent)s%

source: There was an error uploading your file.
ru: Ошибка при загрузке файла.

source: Uploading... %(percent)s %
ru: Файл загружается... %(percent)s %

source: yes
ru: да

source: Grade must be a number.
ru: Оценка должна быть числом.

source: Grade must be an integer.
ru: Оценка должна быть целым числом.

source: Grade must be positive.
ru: Оценка должна быть положительной.

source: Maximum score is %(max_score)s
ru: Максимальная оценка — %(max_score)s

source: No grade to remove.
ru: Нет оценки для удаления.

source: An error occurred while trying to prepare your submission file
ru: Ошибка при сборке файла с работами слушателей

source: Student submission file ready for download
ru: Файл с работами слушателей готов к скачиванию

source: An error occurred while trying to get the status of your submission file.
ru: Ошибка при получении статуса сборки файла с работами слушателей.
