Repository: Lektorium-LLC/edx-sga
Catalog: edx_sga/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Display Name
ru: Отображаемое название

source: Staff Graded Assignment
ru: Оценивание персоналом

source: This name appears in the horizontal navigation at the top of the page.
ru: Данное название показывается на горизонтальной ленте навигации в верхней части страницы.

source: Problem Weight
ru: Весовой коэффициент задания

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
ru: Задаёт количество баллов за задание. Если значение не установлено, каждая задача оценивается как сумма баллов по каждой опции.

source: Maximum score
ru: Максимальный балл

source: Maximum grade score given to assignment by staff.
ru: Максимальная оценка, которую может выставить сотрудник.

source: Score assigned by non-instructor staff
ru: Оценка ассистента

source: Score will need to be approved by instructor before being published.
ru: Оценка, которую должен подтвердить преподаватель перед оглашением.

source: Instructor comment
ru: Комментарий преподавателя

source: Feedback given to student by instructor.
ru: Обратная связь от преподавателя к студенту.

source: Annotated SHA1
ru: SHA1 файла с комментариями

source: sha1 of the annotated file uploaded by the instructor for this assignment.
ru: sha1 файла, загруженного преподавателем для данного ответа.

source: Annotated file name
ru: Название файла с комментариями

source: The name of the annotated file uploaded for this assignment.
ru: Название файла с комментариями, загруженного для данного ответа

source: Mime type of annotated file
ru: MIME-тип файла с комментариями

source: The mimetype of the annotated file uploaded for this assignment.
ru: MIME-тип файла с комментариями для данного ответа.

source: Timestamp
ru: Время загрузки

source: When the annotated file was uploaded
ru: Время загрузки файла с комментариями

source: Show Answer
ru: Показать ответ

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
ru: Определяет, когда отображать ответ на задание. В расширенных настройках можно установить значение по умолчанию.

source: Always
ru: Всегда

source: Answered
ru: Дан ответ

source: Attempted
ru: Использована попытка

source: Closed
ru: Закрыт

source: Finished
ru: Выполнено

source: Correct or Past Due
ru: Ответ верен или прошёл срок сдачи

source: Past Due
ru: Прошёл срок сдачи

source: Never
ru: Никогда

source: Solution to the problem to show to the user
ru: Решение задачи, показываемое пользователю

source: Solution
ru: Решение

source: Upload a different file
ru: Загрузить другой файл

source: Upload your assignment
ru: Загрузите свой ответ на задание

source: File uploaded
ru: Загруженный файл

source: Your score is <%%= graded.score %%> / <%%= max_score %%>
ru: Ваша оценка: <%%= graded.score %%> / <%%= max_score %%>

source: Annotated file from instructor
ru: Файл с комментариями преподавателя

source: This assignment has not yet been graded.
ru: Задание пока не оценено преподавателем.

source: Submit
ru: Отправить

source: Username
ru: Имя пользователя

source: Name
ru: Полное имя

source: Filename
ru: Имя файла

source: Uploaded
ru: Загружен

source: Submitted
ru: Загружено

source: Grade
ru: Оценка

source: Instructor's comments
ru: Комментарии преподавателя

source: Annotated
ru: Файл с комментариями

source: Actions
ru: Действия

source: Yes
ru: Да

source: No
ru: Нет

source: Awaiting instructor approval
ru: В ожидании утверждения преподавателем

source: Approve grade
ru: Утвердить оценку

source: Enter grade
ru: Ввести оценку

source: Upload annotated file
ru: Загрузить файл с комментариями

source: Grade Submissions
ru: Оценить работы

source: Download All Submissions
ru: Скачать все работы

source: Loading...
ru: Загрузка...

source: Staff Debug
ru: Отладка

source: is_released
ru: выпущен

source: location
ru: местонахождение

source: Module Fields
ru: Поля модуля

source: category
ru: категория

source: Enter Grade
ru: Введите оценку

source: Grade for %(student_name)s
ru: Оценка слушателя %(student_name)s

source: Grade:
ru: Оценка:

source: Comment:
ru: Комментарий:

source: Cancel
ru: Отменить

source: Remove grade
ru: Удалить оценку
